[
  {
    "dates": "Jun 2024 · Present",
    "role": "Full Stack Developer",
    "company": "Freelancing",
    "description": [
      "Reduced initial loading time, leading to faster page performance and improved customer retention.",
      "Redesigned and optimized landing pages with enhanced product presentation and integrated data visualization, improving user experience and engagement."
    ],
    "logo": "/assets/images/me.jpeg",
    "website": "mailto:muhammadtayyabasghar@gmail.com",
    "detailsPage": ""
  },
  {
    "dates": "Sep 2024 · Nov 2024",
    "role": "Software Engineer",
    "company": "Ensemble",
    "description": [
      "Developed and delivered the desktop app using Electron.js, ensuring 100% cross-platform compatibility.",
      "Enabled offline editing & real-time synchronization, integrating Firestore Cloud Functions, allowing users to create applications offline.",
      "Achieved 30% test coverage for the Firestore Cloud Functions using Jest and setting up repository pattern to improve code organization.",
      "Integrated Git support, enabling code storing on repository management services like GitHub and Bitbucket."
    ],
    "logo": "/assets/images/company/ensemble.jpeg",
    "website": "https://ensembleui.com",
    "detailsPage": "/portfolio/ensemble-low-code-development-platform"
  },
  {
    "dates": "Jun 2022 · May 2024",
    "role": "Software Engineer (Outsourced by Rolustech)",
    "company": "LexCheck",
    "description": [
      "Revamped the LexCheck app, enhancing UI/UX and performance, leading to a 20% increase in sales.",
      "Implemented Role-Based Access Control (RBAC) with user-specific dashboards and data visualizations, improving access control and security.",
      "Optimized app performance by 35% by reducing bundle size by 10%, implementing lazy loading, memory leak fixes, and removing redundant libraries.",
      "Strengthened security by enforcing strict CSP headers, securing sensitive data with Web APIs, and ensuring SOC 2 Type II compliance.",
      "Collaborated in the migration of cloud infrastructure from AWS to Azure DevOps, optimizing performance and reducing operational costs by 30%.",
      "Streamlined the onboarding process for junior developers by documenting workflows and best practices, improving efficiency by 40% and reducing training costs."
    ],
    "logo": "/assets/images/company/lexcheck.svg",
    "website": "https://www.lexcheck.com",
    "detailsPage": "/portfolio/lexcheck-ai-contract-review-system"
  }
]