[
  {
    "name": "Muhammad Waqas Butt",
    "profile": "/assets/testimonials/muhammad-waqas-butt.jpeg",
    "designation": "Solution Architect | Principal Software Engineer",
    "linkedin": "https://www.linkedin.com/in/muhammad-waqas-butt",
    "text": "<span>During my tenure at RolusTech, worked with Tayyab closely and found him brilliant in technical, professional and personal aspects.<br>He is a person, who always looks deep and wide before providing the solution. He has mastered many technical fronts and always eager to conquer more with passion and effectiveness.</span>"
  },
  {
    "name": "Ammarah Yousaf",
    "profile": "/assets/testimonials/ammarah-yousaf.jpeg",
    "designation": "Principal Software Engineer | Full Stack Engineer",
    "linkedin": "https://www.linkedin.com/in/ammarah-yousaf-215563123",
    "text": "<span>I have had the pleasure of working with Tayyab for over two years. We first met when he joined our team as an Associate Software Engineer, and I have since served as both his mentor and frontend lead.<br>During our time together, I have been consistently impressed by Tayyab’s ability to quickly grasp both logical and business domains. He has a keen eye for identifying and fixing issues within web applications, making him an invaluable asset to our team. His dedication to improving the web application code, particularly in the realm of clean architecture, showcases his excellent programming skills. Recently, he has also expanded his expertise to include backend development, demonstrating his versatility and continuous growth.<br>On a personal level, Tayyab is a true professional and a team player. His work ethic, collaborative spirit, and eagerness to learn make him a joy to work with. I highly recommend Tayyab for any role that requires technical proficiency and a strong team-oriented mindset.</span>"
  },
  {
    "name": "Zain Rizwan",
    "profile": "/assets/testimonials/default-linkedin.png",
    "designation": "Senior Software Engineer",
    "linkedin": "https://www.linkedin.com/in/zain-rizwan-760a9718a",
    "text": "<span>Tayyab is one of the most hardworking and dedicated colleague of mine, his analytical skills and his command on the tech is appreciable. He's very detailed orientated and always deliver high quality work. He's pro in what he do and he's always focused on delivering the best work.</span>"
  },
  {
    "name": "Pivak E Safa",
    "profile": "/assets/testimonials/pivak-e-safa.jpeg",
    "designation": "Senior Software Engineer",
    "linkedin": "https://www.linkedin.com/in/pivak-e-safa",
    "text": "<span>I highly recommend Tayyab for his exceptional contributions to our team. From the outset, he demonstrated an impressive ability to grasp the complex code base swiftly, enabling him to deliver results efficiently. What sets him apart is not only his dedication to completing tasks promptly but also his proactive approach to enhancing and refactoring the code quality. Moreover, his professional demeanor and respectful behavior create a positive work environment, and he is always eager to embrace new challenges and expand his skill set.</span>"
  }
]